Tekla Open API Reference for Tekla Structures 2025
BaseComponent.GetAttribute Method
Overload List
Name | Description
GetAttribute(String, Double)
 Retrieves the attribute with the given name.
GetAttribute(String, Int32)
 Retrieves the attribute with the given name.
GetAttribute(String, String)
 Retrieves the attribute with the given name.
Top
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace